{
  "basics": {
    "name": "Jose Miguel Herrera",
    "label": "Full Stack Engineer Building The Future of Technology, Today.",
    "picture": "./jose.jpg",
    "email": "josemiguelherrera@protonmail.com",
    "summary": "Software Engineer specialized in full stack develpoment; distributed computing, blockchain engineering; and cryptography/cybersecurity. I enjoy working on an exciting projects that leverage my wide array of skills. Proven success in taking projects from requirements to production. Send me a message to share insights on projects.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Toronto",
      "countryCode": "Canada",
      "region": "Ontario"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "Jose Herrera",
        "url": "https://github.com/JoseMiguelHerrera"
      },
      {
        "network": "Angellist",
        "username": "Jose Herrera",
        "url": "https://angel.co/jose-herrera-5"
      },
      {
        "network": "LinkedIn",
        "username": "Jose Herrera",
        "url": "https://www.linkedin.com/in/joseherreram/"
      }
    ]
  },
  "work": [
    {
      "company": "Novera Capital",
      "position": "Lead Engineer",
      "website": "https://novera.com",
      "startDate": "2018-08-01",
      "summary": "Helping build the future of finance.",
      "highlights": [
        "Lead full stack developer of all Novera products. Reporting directly to the CTO. Developed decentralized financial derivatives and scalable distributed systems.",
        "Designing all software architecture according to business requirements before coding them.",
        "Using solidity, web3js, react, ganache, mythril, truffle, and meadowsuite for ethereum blockchain product development. Additional experience with bitshares infrastructure and assets.",
        "Developing private fund software (backend: NodeJS, MongoDB) for maximum scalability and performance.",
        "Own devops and cloud infrustructure processes (Azure, AWS, Heroku)",
        "Helping implement organizational cybersecurity.",
        "Built a distributed HSM system using state of the art encryption/cybersecurity for blockchain operations.",
        "Showed leadership by aiding in the hiring process to grow and train the engineering team. Working with frontend developers and contractors to create fully functional products."
      ]
    },
    {
      "company": "Polymath",
      "position": "Software Engineer/Developer/Contractor",
      "website": "https://polymath.network",
      "startDate": "2018-06-01",
      "endDate": "2018-08-01",
      "summary": "Helped build the Polymath STO platform.",
      "highlights": [
        "Used solidity, web3js, react, redux, and ganache.",
        "Helped bring the Polymath Dapp to main net. Shipped version 1.3 with new features (see below).",
        "https://blog.polymath.network/polymath-core-mainnet-v1-3-0-release-8921e8046508?gi=764b2373c020"
      ]
    },
    {
      "company": "Bull Bitcoin",
      "position": "Software Engineer/Developer/Contractor",
      "website": "https://bullbitcoin.com/",
      "startDate": "2018-06-01",
      "endDate": "2018-08-01",
      "summary": "Helped build the Bull Bitcoin Platform platform.",
      "highlights": [
        "Creating custom full stack software to increase Bitcoin adoption in Canada, specially in regards of banking/regulatory compliance. KYC/AML.",
        "Using statistical predictive analysis to make Bitcoin mining more profitable.",
        "Automatization of Bitcoin related tax accounting."
      ]
    },
    {
      "company": "The Ethereum Billboard",
      "position": "Founder/Developer",
      "website": "https://github.com/JoseMiguelHerrera/ethereumbilboard",
      "startDate": "2017-10-01",
      "endDate": "2018-07-01",
      "summary": "A social experiment that lies at the intersection of conceptual art, cutting edge tech, and a discussion of issues relevant to our times. On the billboard, you can pay some Ether to display anything you want, as long as you pay the current market price, which is calculated from the price paid for the last ad and the time since it was put up. We want to explore themes of cryptoeconomics, free speech, and human nature.",
      "highlights": [
        "Built on Ethereum/Solidity",
        "Raised ~1000$ at peak times",
        "Vitalik Buterin provided feedback on how to improve, which was implemented in version 2."
      ]
    },
    {
      "company": "BlockVote",
      "position": "Project Manager/Developer",
      "website": "",
      "startDate": "2016-12-11",
      "endDate": "2017-06-01",
      "summary": "BlockVote is an ongoing project in which blockchain technology is leveraged to allow distributed computing in order to solve the concerns of security, anonymity and verification that affect traditional voting systems.",
      "highlights": [
        "Built with Hyperledger Fabric and nodeJS.",
        "Uses state of the art encryption to ensure only the voter knows that a cast ballot belongs to them.",
        "Voters vote on a mobile (Android) application after they get registered by a registrar, who also uses an Android app.",
        "Elections can be configured in terms of start/end dates, number of voting sub-districts, and if live results are enabled."
      ]
    },
    {
      "company": "Critical Mass",
      "position": "Developer Intern",
      "website": "http://www.criticalmass.com/",
      "startDate": "2017-05-15",
      "endDate": "2017-08-18",
      "summary": "Critical Mass is an experience design agency with a relentless focus on the customer. Developer interns assist in implementing digital solutions for world-class brands.",
      "highlights": [
        "Architected and implemented a scalable software project to automate marketing science activities with the goal of reducing costs across the board. (NodeJS/GraphQL/MongoDB/JS-HTML-CSS)",
        "Worked on the Travel Alberta account (web development)",
        "Created a React Native application for internal use",
        "Participated in Citi FinTech Citiblue reboot. Did UI/UX/technical feasibility/fintech research/requirement analysis"
      ]
    },
    {
      "company": "IBM",
      "position": "Business Process Management Developer Intern",
      "website": "http://www.IBM.com/",
      "startDate": "2015-05-15",
      "endDate": "2016-08-15",
      "summary": "IBM Business Process Manager is a full-featured, consumable business process management (BPM) platform. It includes tooling and run time for process design and execution, along with capabilities for monitoring and optimizing work that is executed within the platform.",
      "highlights": [
        "Worked in a team to develop and maintain IBM’s Business Process Management software, using HTML, CSS, and JavaScript.",
        "Assisted in the architectural endeavour of porting BPM to the cloud.",
        "Ensured that the BPM software was accessible to customers with disabilities.",
        "Tested the BPM software using both blackbox and whitebox methodologies, such as Selenium WebDriver.",
        "Created testing documentation while keeping Agile methodologies."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "CIBC Run for the Cure",
      "position": "Developer/Volunteer",
      "website": "http://cibcrunforthecure.supportcbcf.com/",
      "startDate": "2015-10-01",
      "endDate": "2015-10-30",
      "summary": "WebApp used in CIBC's 2015 Run For The Cure in Toronto. Used to significantly speed up the check in process by allowing volunteers with iPads to check in participants who had previously registered online.",
      "highlights": ["Built with NodeJS and Cloudant", "Sponsored by IBM"]
    },
    {
      "organization": "Engineers Without Borders",
      "position": "Social Events Director",
      "website": "https://www.ewb.ca/",
      "startDate": "2013-05-30",
      "endDate": "2014-05-30",
      "summary": "Organized social event logistics as well as their corresponding fundraising components."
    }
  ],
  "education": [
    {
      "institution": "University of Calgary - Schulich School of Engineering ",
      "area": "Software Engineering",
      "studyType": "Bachelor",
      "startDate": "2012-09-01",
      "endDate": "2017-11-20",
      "gpa": ""
    }
  ],
  "awards": [],
  "publications": [
    {
      "name": "Business in the Front, Crypto in the Back: How to Be a Blockchain Startup in Fintech.",
      "publisher": "SSRN",
      "releaseDate": "2019-09-09",
      "website": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3423179",
      "summary": "We present the journey by which Novera, a blockchain start-up, partnered with CompanyX, an SME investment firm actively looking for opportunities to leverage disruptive technologies. We believe that the key to this journey is expressed in Novera’s “Business in the front, crypto in the back” perspective."
    },
    {
      "name": "University of Calgary students close in on fraud-proof electronic voting system",
      "publisher": "Calgary Herald",
      "releaseDate": "2017-4-11",
      "website": "http://calgaryherald.com/news/local-news/university-of-calgary-students-close-in-on-fraud-proof-electronic-voting-system",
      "summary": "Herrera along with his four team members are using IBM's Blockchain technology to create what they hope will be fraud-proof electronic voting"
    }
  ],
  "skills": [
    {
      "name": "Software Engineering",
      "level": "Master",
      "keywords": [
        "Solidity",
        "HTML",
        "CSS",
        "AWS",
        "Software Architecture",
        "Javascript",
        "C/C++",
        "Java",
        "NodeJS",
        "Python",
        "Blockchain",
        "Cybersecurity",
        "NoSQL",
        "GoLang",
        "DevOps",
        "RESTful Design",
        "Distributed Systems",
        "GraphQL APIs",
        "IPFS",
        "React/React Native",
        "Bitcoin"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native speaker"
    },
    {
      "language": "Spanish",
      "fluency": "Native speaker"
    },
    {
      "language": "French",
      "fluency": "Advanced"
    }
  ],
  "interests": [
    {
      "name": "Music",
      "keywords": [
        "Composition",
        "Mixing",
        "Mastering",
        "Songwriting",
        "Sound Design",
        "Marketing"
      ]
    },
    {
      "name": "Cryptocurrency/Blockchain",
      "keywords": [
        "Bitcoin",
        "Ethereum",
        "Decentralized autonomous organizations",
        "Investment",
        "Cryptography",
        "Decentralization",
        "Trading",
        "Electronic Voting"
      ]
    },
    {
      "name": "Science",
      "keywords": [
        "Psychology",
        "Physics",
        "Computer Science",
        "Mathematics",
        "Social Science"
      ]
    }
  ],
  "references": []
}
